taisuke942/test/LBW-155_3.0_230726/MSP430_BMS_PL536/SourceCode/USB_Common/usb.c
    /* Set settings for IEP3 */
    // enable endpoint 3 bulk, input
    tInputEndPointDescriptorBlock[EDB(CDC_INEP_ADDR)].bEPCNF   = EPCNF_USBIE       // use Interrupt for this EP
                                                | EPCNF_UBME      // enable this EP
                                                | EPCNF_DBUF;     // use double buffering (X and Y buffers)
    tInputEndPointDescriptorBlock[EDB(CDC_INEP_ADDR)].bEPBBAX  = (BYTE)(((IEP3_X_BUFFER_ADDRESS - START_OF_USB_BUFFER) >> 3) & 0x00ff);
    tInputEndPointDescriptorBlock[EDB(CDC_INEP_ADDR)].bEPBBAY  = (BYTE)(((IEP3_Y_BUFFER_ADDRESS - START_OF_USB_BUFFER) >> 3) & 0x00ff);
    tInputEndPointDescriptorBlock[EDB(CDC_INEP_ADDR)].bEPBCTX  = EPBCNT_NAK;       // NAK: the buffer has no valid data to send to host
    tInputEndPointDescriptorBlock[EDB(CDC_INEP_ADDR)].bEPBCTY  = EPBCNT_NAK;       // NAK: the buffer has no valid data to send to host
    tInputEndPointDescriptorBlock[EDB(CDC_INEP_ADDR)].bEPSIZXY = MAX_PACKET_SIZE;

    /* Set settings for OEP3 */
    // enable endpoint 3 bulk, output
    tOutputEndPointDescriptorBlock[EDB(CDC_OUTEP_ADDR)].bEPCNF   = EPCNF_USBIE      // use Interrupt for this EP
                                                 | EPCNF_UBME     // enable this EP
                                                 | EPCNF_DBUF;    // use double buffering (X and Y buffers)
    tOutputEndPointDescriptorBlock[EDB(CDC_OUTEP_ADDR)].bEPBBAX  = (BYTE)(((OEP3_X_BUFFER_ADDRESS - START_OF_USB_BUFFER) >> 3) & 0x00ff);
    tOutputEndPointDescriptorBlock[EDB(CDC_OUTEP_ADDR)].bEPBBAY  = (BYTE)(((OEP3_Y_BUFFER_ADDRESS - START_OF_USB_BUFFER) >> 3) & 0x00ff);
    tOutputEndPointDescriptorBlock[EDB(CDC_OUTEP_ADDR)].bEPBCTX  = 0x00;
    tOutputEndPointDescriptorBlock[EDB(CDC_OUTEP_ADDR)].bEPBCTY  = 0x00;
    tOutputEndPointDescriptorBlock[EDB(CDC_OUTEP_ADDR)].bEPSIZXY = MAX_PACKET_SIZE;

    CdcResetData();                     // reset CDC specific data structures

  #endif // _CDC_

    USBCTL |= FEN;                      // enable function
    USBIFG = 0;                         // make sure no interrupts are pending

    USBIE = SETUPIE | RSTRIE | SUSRIE;  // enable USB specific interrupts (setup, reset, suspend)
    USBKEYPID = 0x9600;                 // access to configuration registers disabled
    return kUSB_succeed;
}

/*
Instruct USB module to make itself available to the PC for connection, by pulling PUR high.
*/
BYTE USB_connect()
{
    USBKEYPID = 0x9628;   // set KEY and PID to 0x9628 -> access to configuration registers enabled
    USBCNF |= PUR_EN;     // generate rising edge on DP -> the host enumerates our device as full speed device
    USBPWRCTL |= VBOFFIE; // enable interrupt VUSBoff
    USBKEYPID = 0x9600;   // access to configuration registers disabled

    // after this the enumeration may take place
    __no_operation();
    __no_operation();
    __no_operation();
    __no_operation();
    __no_operation();
    __no_operation();
    __no_operation();

    return kUSB_succeed;
}

/*
Force a disconnect from the PC by pulling PUR low.
*/
BYTE USB_disconnect()
{
    USBKEYPID = 0x9628;     // set KEY and PID to 0x9628 -> access to configuration registers enabled
    USBCNF &= ~PUR_EN;      // disconnect pull up resistor - logical disconnect from HOST
    //USBCNF = 0;            // disable USB module
    USBPWRCTL &= ~VBOFFIE;  // disable interrupt VUSBoff
    USBKEYPID = 0x9600;     // access to configuration registers disabled
    bEnumerationStatus = 0; // not enumerated
    bFunctionSuspended = FALSE;     // device is not suspended
    return kUSB_succeed;
}

/*
Force a remote wakeup of the USB host.
*/
BYTE USB_forceRemoteWakeup()
{
    if (bFunctionSuspended == FALSE) // device is not suspended
    {
        return kUSB_NotSuspended;
    }
    if(bRemoteWakeup == ENABLE)
    {
    	volatile unsigned int i;
        USBCTL |= RWUP;             // USB - Device Remote Wakeup Request - this bit is self-cleaned
        return kUSB_succeed;
    }
    return kUSB_generalError;
}

/*
Returns the status of the USB connection.
*/
BYTE USB_connectionInfo()
{
    BYTE retVal = 0;
    if (USBPWRCTL & USBBGVBV)
    {
        retVal |= kUSB_vbusPresent;
    }

    if (bEnumerationStatus == ENUMERATION_COMPLETE)
    {
        retVal |= kUSB_Enumerated;
    }
    /*
    if () //sync frame are received
    {
        kUSB_busActive;
    } */

    if (USBCNF & PUR_EN)
    {
        retVal |= kUSB_purHigh;
    }

    if (bFunctionSuspended == TRUE)
    {
        retVal |= kUSB_suspended;
    }
    else
    {
        retVal |= kUSB_NotSuspended;
    }
    return retVal;
}

/*
Returns the state of the USB connection.
*/
BYTE USB_connectionState()
{
    // If no VBUS present
    if (!(USBPWRCTL & USBBGVBV))
    {
        return ST_USB_DISCONNECTED;
    }

    // If VBUS present, but PUR is low
    if ((USBPWRCTL & USBBGVBV)&&(!(USBCNF & PUR_EN)))
    {
        return ST_USB_CONNECTED_NO_ENUM;
    }

    // If VBUS present, PUR is high, and enumeration is complete, and not suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (bEnumerationStatus == ENUMERATION_COMPLETE)
        && (!(bFunctionSuspended == TRUE)))
    {
        return ST_ENUM_ACTIVE;
    }

    // If VBUS present, PUR is high, and enumeration is NOT complete, and  suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (!(bEnumerationStatus == ENUMERATION_COMPLETE))
        && (bFunctionSuspended == TRUE))
    {
        return ST_NOENUM_SUSPENDED;
    }
        
    // If VBUS present, PUR is high, and enumeration is complete, and  suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (bEnumerationStatus == ENUMERATION_COMPLETE)
        && (bFunctionSuspended == TRUE))
    {
        return ST_ENUM_SUSPENDED;
    }
    
    // If VBUS present, PUR is high, but no enumeration yet
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (!(bEnumerationStatus == ENUMERATION_COMPLETE)))
    {
        return ST_ENUM_IN_PROGRESS;
    }
    
