taisuke942/test/LBW-155_3.0_230726/MSP430_BMS_PL536/SourceCode/USB_Common/usb.c
    // end of usb descriptor -- this one will be matched to any USB request
    //                          since bCompareMask is 0x00.
    0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
    0x00,&usbInvalidRequest     // end of list
};

typedef VOID (*tpF)(VOID);

BYTE usbDecodeAndProcessUsbRequest(VOID)
{
    BYTE  bMask,bResult,bTemp;
    const BYTE* pbUsbRequestList;
    BYTE bWakeUp = FALSE;
    ptDEVICE_REQUEST ptSetupPacket = &tSetupPacket;
    BYTE  bRequestType,bRequest;
    DWORD lAddrOfFunction;

    // point to beginning of the matrix
    pbUsbRequestList = (PBYTE)&tUsbRequestList[0];

    while(1){

        bRequestType = *pbUsbRequestList++;
        bRequest     = *pbUsbRequestList++;

        if(((bRequestType == 0xff) && (bRequest == 0xff)) ||
            (tSetupPacket.bmRequestType == (USB_REQ_TYPE_INPUT | USB_REQ_TYPE_VENDOR | USB_REQ_TYPE_DEVICE)) ||
            (tSetupPacket.bmRequestType == (USB_REQ_TYPE_OUTPUT | USB_REQ_TYPE_VENDOR | USB_REQ_TYPE_DEVICE)))
        {
            pbUsbRequestList -= 2;
            break;
        }

        if((bRequestType == tSetupPacket.bmRequestType) && (bRequest == tSetupPacket.bRequest))
        {
            // compare the first two
            bResult = 0xc0;
            bMask   = 0x20;
            // first two bytes matched, compare the rest
            for(bTemp = 2; bTemp < 8; bTemp++)
            {
                if (*((BYTE*)ptSetupPacket + bTemp) == *pbUsbRequestList)
                {
                    bResult |= bMask;
                }
                pbUsbRequestList++;
                bMask = bMask >> 1;
            }
            // now we have the result
            if((*pbUsbRequestList & bResult) == *pbUsbRequestList)
            {
                pbUsbRequestList -= 8;
                break;
            }
            else
            {
                pbUsbRequestList += (sizeof(tDEVICE_REQUEST_COMPARE)-8);
            }
        }
        else
        {
            pbUsbRequestList += (sizeof(tDEVICE_REQUEST_COMPARE)-2);
        }
    }

    // if another setup packet comes before we have the chance to process current
    // setup request, we return here without processing the request
    // this check is not necessary but still kept here to reduce response(or simulation) time

    if((USBIFG & STPOWIFG) != 0x00)
    {
        return bWakeUp;
    }

    // now we found the match and jump to the function accordingly.
    // tDEVICE_REQUEST_COMPARE  -->  member of structure
    // VOID(*pUsbFunction)(VOID) --> function pointer in the structure we want to call 
    lAddrOfFunction = *((PDWORD)((pbUsbRequestList) + 10));

    // call function
    ((tpF)lAddrOfFunction)();
    
    // perform enumeration complete event:
    // when SetAddress was called and USBADDR is not zero
    if (((tpF)lAddrOfFunction == &usbSetAddress) && (USBFUNADR != 0))
    {
        bWakeUp = USB_handleEnumCompleteEvent();
    }
    return bWakeUp;
}

/*----------------------------------------------------------------------------+
| End of source file                                                          |
+----------------------------------------------------------------------------*/
/*------------------------ Nothing Below This Line --------------------------*/
